define e = Character('Эйлин', color="#c8ffc8")


label start:

    play music ingame_music

    scene elite_buildig

    pause 1.0

    scene hero_monit with dissolve

    "Вектор был отчислен из института IT-технологий из-за того, что весь 2-ой курс даже не появлялся на парах"

    scene funeral with dissolve

    "Все эти прогулы были связаны со смертью его матери от рака желудка"

    scene door with dissolve

    "Впавший в глубочайшую депрессию, Вектор закрывается в себе"

    scene father with dissolve

    "Его отцом был влиятельный бизнесмен, которому не было дела до воспитания сына (от первого и неудачного брака), в отличии от умершей матери"
    
    scene pcs with dissolve

    "Спустя год депрессии после трагедии, Вектор, благодаря деньгам отца, смог обеспечить себя лучшим хакерским оборудованием"

    scene hello_mayhem

    "Также ему удалось найти в даркнете группировку “Hello, mayhem”, крайне радикально настроенных чёрных хакеров, стремящихся разрушить мировой порядок и явить миру своё Я"

    scene education

    "На протяжении 2 лет они обучали Вектора всему, что умели сами"

    scene some_person

    "Наконец лидеры движения дали Вектору первое задание: “Отомстить главному обидчику”, после чего Вектор наконец покажет, что он достоин для посвящения в великий план “Hello, mayhem”"

    scene dont_know

    "Про этот план он слышит каждый день, но до сих пор ничего не знает..."

    return
